const copperplateList = [
  ['𝒜', '𝒶', '𝓐', '𝓪'],
  ['ℬ', '𝒷', '𝓑', '𝓫'],
  ['𝒞', '𝒸', '𝓒', '𝓬'],
  ['𝒟', '𝒹', '𝓓', '𝓭'],
  ['ℰ', 'ℯ', '𝓔', '𝓮'],
  ['ℱ', '𝒻', '𝓕', '𝓯'],
  ['𝒢', 'ℊ', '𝓖', '𝓰'],
  ['ℋ', '𝒽', '𝓗', '𝓱'],
  ['ℐ', '𝒾', '𝓘', '𝓲'],
  ['𝒥', '𝒿', '𝓙', '𝓳'],
  ['𝒦', '𝓀', '𝓚', '𝓴'],
  ['ℒ', '𝓁', '𝓛', '𝓵'],
  ['ℳ', '𝓂', '𝓜', '𝓶'],
  ['𝒩', '𝓃', '𝓝', '𝓷'],
  ['𝒪', 'o', '𝓞', '𝓸'],
  ['𝒫', '𝓅', '𝓟', '𝓹'],
  ['𝒬', '𝓆', '𝓠', '𝓺'],
  ['ℛ', '𝓇', '𝓡', '𝓻'],
  ['𝒮', '𝓈', '𝓢', '𝓼'],
  ['𝒯', '𝓉', '𝓣', '𝓽'],
  ['𝒰', '𝓊', '𝓤', '𝓾'],
  ['𝒱', '𝓋', '𝓥', '𝓿'],
  ['𝒲', '𝓌', '𝓦', '𝔀'],
  ['𝒳', '𝓍', '𝓧', '𝔁'],
  ['𝒴', '𝓎', '𝓨', '𝔂'],
  ['𝒵', '𝓏', '𝓩', '𝔃']
]
const copperplates = {}
const gothicList = [
  ['𝔄', '𝔞', '𝕬', '𝖆'],
  ['𝔅', '𝔟', '𝕭', '𝖇'],
  ['ℭ', '𝔠', '𝕮', '𝖈'],
  ['𝔇', '𝔡', '𝕯', '𝖉'],
  ['𝔈', '𝔢', '𝕰', '𝖊'],
  ['𝔉', '𝔣', '𝕱', '𝖋'],
  ['𝔊', '𝔤', '𝕲', '𝖌'],
  ['ℌ', '𝔥', '𝕳', '𝖍'],
  ['ℑ', '𝔦', '𝕴', '𝖎'],
  ['𝔍', '𝔧', '𝕵', '𝖏'],
  ['𝔎', '𝔨', '𝕶', '𝖐'],
  ['𝔏', '𝔩', '𝕷', '𝖑'],
  ['𝔐', '𝔪', '𝕸', '𝖒'],
  ['𝔑', '𝔫', '𝕹', '𝖓'],
  ['𝔒', '𝔬', '𝕺', '𝖔'],
  ['𝔓', '𝔭', '𝕻', '𝖕'],
  ['𝔔', '𝔮', '𝕼', '𝖖'],
  ['ℜ', '𝔯', '𝕽', '𝖗'],
  ['𝔖', '𝔰', '𝕾', '𝖘'],
  ['𝔗', '𝔱', '𝕿', '𝖙'],
  ['𝔘', '𝔲', '𝖀', '𝖚'],
  ['𝔙', '𝔳', '𝖁', '𝖛'],
  ['𝔚', '𝔴', '𝖂', '𝖜'],
  ['𝔛', '𝔵', '𝖃', '𝖝'],
  ['𝔜', '𝔶', '𝖄', '𝖞'],
  ['ℨ', '𝔷', '𝖅', '𝖟']
  ]
const gothics = {}

const mathematical = {}
const mathematicalList = [['𝐀', '𝐚', '𝐀', '𝐚'],
['𝐁', '𝐛', '𝐁', '𝐛'],
['𝐂', '𝐜', '𝐂', '𝐜'],
['𝐃', '𝐝', '𝐃', '𝐝'],
['𝐄', '𝐞', '𝐄', '𝐞'],
['𝐅', '𝐟', '𝐅', '𝐟'],
['𝐆', '𝐠', '𝐆', '𝐠'],
['𝐇', '𝐡', '𝐇', '𝐡'],
['𝐈', '𝐢', '𝐈', '𝐢'],
['𝐉', '𝐣', '𝐉', '𝐣'],
['𝐊', '𝐤', '𝐊', '𝐤'],
['𝐋', '𝐥', '𝐋', '𝐥'],
['𝐌', '𝐦', '𝐌', '𝐦'],
['𝐍', '𝐧', '𝐍', '𝐧'],
['𝐎', '𝐨', '𝐎', '𝐨'],
['𝐏', '𝐩', '𝐏', '𝐩'],
['𝐐', '𝐪', '𝐐', '𝐪'],
['𝐑', '𝐫', '𝐑', '𝐫'],
['𝐒', '𝐬', '𝐒', '𝐬'],
['𝐓', '𝐭', '𝐓', '𝐭'],
['𝐔', '𝐮', '𝐔', '𝐮'],
['𝐕', '𝐯', '𝐕', '𝐯'],
['𝐖', '𝐰', '𝐖', '𝐰'],
['𝐗', '𝐱', '𝐗', '𝐱'],
['𝐘', '𝐲', '𝐘', '𝐲'],
['𝐙', '𝐳', '𝐙', '𝐳']]


const italics = {}
const italicList = [
  ['𝐴', '𝑎', '𝑨', '𝒂'],
  ['𝐵', '𝑏', '𝑩', '𝒃'],
  ['𝐶', '𝑐', '𝑪', '𝒄'],
  ['𝐷', '𝑑', '𝑫', '𝒅'],
  ['𝐸', '𝑒', '𝑬', '𝒆'],
  ['𝐹', '𝑓', '𝑭', '𝒇'],
  ['𝐺', '𝑔', '𝑮', '𝒈'],
  ['𝐻', 'ℎ', '𝑯', '𝒉'],
  ['𝐼', '𝑖', '𝑰', '𝒊'],
  ['𝐽', '𝑗', '𝑱', '𝒋'],
  ['𝐾', '𝑘', '𝑲', '𝒌'],
  ['𝐿', '𝑙', '𝑳', '𝒍'],
  ['𝑀', '𝑚', '𝑴', '𝒎'],
  ['𝑁', '𝑛', '𝑵', '𝒏'],
  ['𝑂', '𝑜', '𝑶', '𝒐'],
  ['𝑃', '𝑝', '𝑷', '𝒑'],
  ['𝑄', '𝑞', '𝑸', '𝒒'],
  ['𝑅', '𝑟', '𝑹', '𝒓'],
  ['𝑆', '𝑠', '𝑺', '𝒔'],
  ['𝑇', '𝑡', '𝑻', '𝒕'],
  ['𝑈', '𝑢', '𝑼', '𝒖'],
  ['𝑉', '𝑣', '𝑽', '𝒗'],
  ['𝑊', '𝑤', '𝑾', '𝒘'],
  ['𝑋', '𝑥', '𝑿', '𝒙'],
  ['𝑌', '𝑦', '𝒀', '𝒚'],
  ['𝑍', '𝑧', '𝒁', '𝒛']
  ]

const zimulist = 'abcdefghijklmnopqrstuvwxyz'
const list = zimulist.split('')
list.forEach((i, index) => {
  gothics[i] = gothicList[index]
  copperplates[i] = copperplateList[index]
  mathematical[i] = mathematicalList[index]
  italics[i] = italicList[index]
})


function getFont(capital, small, capitalBold, smallBold) {
  return {
    small,
    smallBold,
    capital,
    capitalBold,
  }
}



function getFontFamily(value) {
  return {
    value,
    types: {
      copperplate: getFont(...copperplates[value]),
      gothic: getFont(...gothics[value]),
      italic: getFont(...italics[value]),
      mathematical: getFont(...mathematical[value]),
    },
  }
}

const map = {}
list.forEach((i) => {
  map[i] = getFontFamily(i)
})

export default map